In [37]:
import numpy as np
import pandas as pd

In [38]:
from numpy.random import randn

In [39]:
df = pd.DataFrame(randn(4,3),[i for i in "ABCD"],"Column1 Column2 Column3".split(" "))

In [40]:
df

    Column1   Column2   Column3
A -0.300678  1.481803  1.150627
B  1.343049 -2.014289  0.577821
C  0.188024 -0.037872  1.111897
D -0.763436 -1.084019 -1.226009

In [41]:
df>-1

   Column1  Column2  Column3
A     True     True     True
B     True    False     True
C     True     True     True
D     True    False    False

In [42]:
df>0

   Column1  Column2  Column3
A    False     True     True
B     True    False     True
C     True    False     True
D    False    False    False

In [43]:
booleanDF = df>0

In [44]:
booleanDF

   Column1  Column2  Column3
A    False     True     True
B     True    False     True
C     True    False     True
D    False    False    False

In [45]:
df[booleanDF]

    Column1   Column2   Column3
A       NaN  1.481803  1.150627
B  1.343049       NaN  0.577821
C  0.188024       NaN  1.111897
D       NaN       NaN       NaN

In [46]:
df[df>0]

    Column1   Column2   Column3
A       NaN  1.481803  1.150627
B  1.343049       NaN  0.577821
C  0.188024       NaN  1.111897
D       NaN       NaN       NaN

In [47]:
df

    Column1   Column2   Column3
A -0.300678  1.481803  1.150627
B  1.343049 -2.014289  0.577821
C  0.188024 -0.037872  1.111897
D -0.763436 -1.084019 -1.226009

In [48]:
df["Column1"]

A   -0.300678
B    1.343049
C    0.188024
D   -0.763436
Name: Column1, dtype: float64

In [49]:
df["Column1"]>0

A    False
B     True
C     True
D    False
Name: Column1, dtype: bool

In [50]:
df[df["Column1"]>0]

    Column1   Column2   Column3
B  1.343049 -2.014289  0.577821
C  0.188024 -0.037872  1.111897

In [51]:
df[df["Column1"]>0.5]

    Column1   Column2   Column3
B  1.343049 -2.014289  0.577821

In [52]:
df[df["Column1"]<0]

    Column1   Column2   Column3
A -0.300678  1.481803  1.150627
D -0.763436 -1.084019 -1.226009

In [53]:
df[df["Column1"]>0]

    Column1   Column2   Column3
B  1.343049 -2.014289  0.577821
C  0.188024 -0.037872  1.111897

In [54]:
df[df["Column2"]>0]

    Column1   Column2   Column3
A -0.300678  1.481803  1.150627

In [55]:
df[df["Column3"]>0]

    Column1   Column2   Column3
A -0.300678  1.481803  1.150627
B  1.343049 -2.014289  0.577821
C  0.188024 -0.037872  1.111897

In [57]:
df[(df["Column2"]>0) and (df["Column3"]>0) ]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [58]:
df[(df["Column2"]>0) & (df["Column3"]>0) ]

    Column1   Column2   Column3
A -0.300678  1.481803  1.150627

In [59]:
df[(df["Column2"]>0) or (df["Column3"]>0) ]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [61]:
df[(df["Column2"]>0) | (df["Column3"]>0) ]#altgr + "-" ile elde edilir pandastaki or i≈üareti.

    Column1   Column2   Column3
A -0.300678  1.481803  1.150627
B  1.343049 -2.014289  0.577821
C  0.188024 -0.037872  1.111897

In [62]:
df

    Column1   Column2   Column3
A -0.300678  1.481803  1.150627
B  1.343049 -2.014289  0.577821
C  0.188024 -0.037872  1.111897
D -0.763436 -1.084019 -1.226009

In [64]:
df["Column4"] = pd.Series(randn(4),[i for i in "ABCD"])

In [65]:
df

    Column1   Column2   Column3   Column4
A -0.300678  1.481803  1.150627  0.694288
B  1.343049 -2.014289  0.577821  0.030524
C  0.188024 -0.037872  1.111897 -0.767424
D -0.763436 -1.084019 -1.226009 -0.493752

In [66]:
df["Column5"] = randn(4)

In [67]:
df

    Column1   Column2   Column3   Column4   Column5
A -0.300678  1.481803  1.150627  0.694288 -1.177415
B  1.343049 -2.014289  0.577821  0.030524  1.027172
C  0.188024 -0.037872  1.111897 -0.767424 -1.262320
D -0.763436 -1.084019 -1.226009 -0.493752 -0.317131

In [68]:
df["Column6"] = "newValue1 newValue2 newValue3 newValue4".split(" ")

In [69]:
df

    Column1   Column2   Column3   Column4   Column5    Column6
A -0.300678  1.481803  1.150627  0.694288 -1.177415  newValue1
B  1.343049 -2.014289  0.577821  0.030524  1.027172  newValue2
C  0.188024 -0.037872  1.111897 -0.767424 -1.262320  newValue3
D -0.763436 -1.084019 -1.226009 -0.493752 -0.317131  newValue4

In [70]:
df.set_index("Column6")

            Column1   Column2   Column3   Column4   Column5
Column6
newValue1 -0.300678  1.481803  1.150627  0.694288 -1.177415
newValue2  1.343049 -2.014289  0.577821  0.030524  1.027172
newValue3  0.188024 -0.037872  1.111897 -0.767424 -1.262320
newValue4 -0.763436 -1.084019 -1.226009 -0.493752 -0.317131

In [71]:
df

    Column1   Column2   Column3   Column4   Column5    Column6
A -0.300678  1.481803  1.150627  0.694288 -1.177415  newValue1
B  1.343049 -2.014289  0.577821  0.030524  1.027172  newValue2
C  0.188024 -0.037872  1.111897 -0.767424 -1.262320  newValue3
D -0.763436 -1.084019 -1.226009 -0.493752 -0.317131  newValue4

In [72]:
df.set_index("Column6", inplace = True)

In [73]:
df

            Column1   Column2   Column3   Column4   Column5
Column6
newValue1 -0.300678  1.481803  1.150627  0.694288 -1.177415
newValue2  1.343049 -2.014289  0.577821  0.030524  1.027172
newValue3  0.188024 -0.037872  1.111897 -0.767424 -1.262320
newValue4 -0.763436 -1.084019 -1.226009 -0.493752 -0.317131

In [75]:
df.index.names#ka√ß indeximiz varsa hepsi g√∂z√ºk√ºcek burada

FrozenList(['Column6'])